def debug(msg):
    print(msg)


def calculate_price(args: dict) -> dict:
    # === ВХОДНЫЕ ПАРАМЕТРЫ ===
    shower_type = args.get("shower_type", "П-образная")
    customer_type = args.get("customer_type", "физлицо")  # физлицо или юрлицо
    glass_type = args.get("glass_type", "Стекло Ритм")
    frame_type = args.get("frame_type", "Квадратная труба")
    hardware_color = args.get("hardware_color", "Бронза")
    length = float(args.get("length", 2))
    height = float(args.get("height", 2))
    mount_type = args.get("mount_type", "На П-профиле")
    connector_type = args.get("connector_type", "Коннектор П-образный")
    handle_type = args.get("handle_type", "Скоба")
    bottom_element = args.get("bottom_element", "Порожек")
    binding_type = args.get("binding_type", "По периметру")
    door_count = args.get("door_count", "Две")
    door_position = args.get("door_position", "С боку")  # только для П-образной
    magnet_seal_type = args.get("magnet_seal_type", "Без магнитного уплотнителя")
    binding_position = args.get("binding_position", "Обвязка над стеклом")
    seal_type = args.get("seal_type", "Полусфера")
    rigid_element_type = args.get("rigid_element_type", "Труба круглая")  # Труба круглая / Штанга круглая / Штанга квадратная
    curtain_type = args.get("curtain_type", "Распашное")  # Распашное / Стационар / Гормошка
    city = args.get("city", "Алматы")

    # === DEBUG: вывод всех входных параметров ===
    debug("[DEBUG] Входные параметры:")
    debug(f"  shower_type: {shower_type}")
    debug(f"  customer_type: {customer_type}")
    debug(f"  glass_type: {glass_type}")
    debug(f"  frame_type: {frame_type}")
    debug(f"  hardware_color: {hardware_color}")
    debug(f"  length: {length}")
    debug(f"  height: {height}")
    debug(f"  mount_type: {mount_type}")
    debug(f"  connector_type: {connector_type}")
    debug(f"  handle_type: {handle_type}")
    debug(f"  bottom_element: {bottom_element}")
    debug(f"  binding_type: {binding_type}")
    debug(f"  door_count: {door_count}")
    debug(f"  door_position: {door_position}")
    debug(f"  magnet_seal_type: {magnet_seal_type}")
    debug(f"  binding_position: {binding_position}")
    debug(f"  seal_type: {seal_type}")
    debug(f"  rigid_element_type: {rigid_element_type}")
    debug(f"  curtain_type: {curtain_type}")
    debug(f"  city: {city}")

    # === ЦЕНЫ НА СТЕКЛО ===
    glass_prices_physical = {
    "Прозрачное стекло 8 мм": 18000,
        "Матовое стекло 8 мм": 20000,
        "Стекло с полосками 8 мм": 22000,
        "Стекло с рисунком 8 мм": 25000,
        "Стекло бронза/графит 8 мм (КАЗАХСТАН)": 23000,
        "Стекло бронза/графит 8 мм (РОССИЯ)": 29000,
        "Стекло c УФ печатью": 28000,
        "Стекло Роса": 37000,
        "Стекло Ритм": 50560,
        "Стекло Кристалвижн": 38000,
        "Стекло Кристалвижн матовое": 40000,
        "Стекло бронза/графит 8 мм матовое (РОССИЯ)": 31000,
        "Стекло бронза/графит 8 мм мат полосы (РОССИЯ)": 33500,
        "Стекло бронза/графит 8 мм рисунок (РОССИЯ)": 36000,
        "Стекло бронза/графит 8 мм с УФ печатью (РОССИЯ)": 39000,
        "Стекло бронза/графит 8 мм матовое (КАЗАХСТАН)": 25000,
        "Стекло бронза/графит 8 мм мат полосы (КАЗАХСТАН)": 27000,
        "Стекло бронза/графит 8 мм рисунок (КАЗАХСТАН)": 31000,
        "Стекло бронза/графит 8 мм с УФ печатью (КАЗАХСТАН)": 33000,
        "Стекло ЧЕРНОЕ 8 мм": 35000
    }

    glass_prices_economy = {
        "Прозрачное стекло 8 мм": 12000,
        "Матовое стекло 8 мм": 14000,
        "Стекло с полосками 8 мм": 16000,
        "Стекло с рисунком 8 мм": 19000,
        "Стекло бронза/графит 8 мм (КАЗАХСТАН)": 20000,
        "Стекло бронза/графит 8 мм (РОССИЯ)": 26000,
        "Стекло c УФ печатью": 22000,
        "Стекло Роса": 37000,
        "Стекло Ритм": 41000,
        "Стекло Кристалвижн": 35000,
        "Стекло Кристалвижн матовое": 37000,
        "Стекло бронза/графит 8 мм матовое (РОССИЯ)": 28000,
        "Стекло бронза/графит 8 мм мат полосы (РОССИЯ)": 30500,
        "Стекло бронза/графит 8 мм рисунок (РОССИЯ)": 33000,
        "Стекло бронза/графит 8 мм с УФ печатью (РОССИЯ)": 35000,
        "Стекло бронза/графит 8 мм матовое (КАЗАХСТАН)": 22000,
        "Стекло бронза/графит 8 мм мат полосы (КАЗАХСТАН)": 24000,
        "Стекло бронза/графит 8 мм рисунок (КАЗАХСТАН)": 28000,
        "Стекло бронза/графит 8 мм с УФ печатью (КАЗАХСТАН)": 29000,
        "Стекло ЧЕРНОЕ 8 мм": 32000
    }

    glass_prices_legal = {
        "Прозрачное стекло 8 мм": 16000,
        "Матовое стекло 8 мм": 18000,
        "Стекло с полосками 8 мм": 20000,
        "Стекло с рисунком 8 мм": 23000,
        "Стекло бронза/графит 8 мм (КАЗАХСТАН)": 19000,
        "Стекло бронза/графит 8 мм (РОССИЯ)": 28000,
        "Стекло c УФ печатью": 23000,
        "Стекло Роса": 0,
        "Стекло Ритм": 48650,
        "Стекло Кристалвижн": 34000,
        "Стекло Кристалвижн матовое": 36000,
        "Стекло бронза/графит 8 мм матовое (РОССИЯ)": 30000,
        "Стекло бронза/графит 8 мм мат полосы (РОССИЯ)": 32000,
        "Стекло бронза/графит 8 мм рисунок (РОССИЯ)": 41000,
        "Стекло бронза/графит 8 мм с УФ печатью (РОССИЯ)": 42500,
        "Стекло бронза/графит 8 мм матовое (КАЗАХСТАН)": 21000,
        "Стекло бронза/графит 8 мм мат полосы (КАЗАХСТАН)": 23000,
        "Стекло бронза/графит 8 мм рисунок (КАЗАХСТАН)": 26000,
        "Стекло бронза/графит 8 мм с УФ печатью (КАЗАХСТАН)": 33000,
        "Стекло ЧЕРНОЕ 8 мм": 30000
    }


    if customer_type == "юрлицо":
        glass_price_m2 = glass_prices_legal.get(glass_type, 0)
    else:
        glass_price_m2 = glass_prices_physical.get(glass_type, 0)
    glass_total = glass_price_m2 * length * height

    glass_price_m2_economy = glass_prices_economy.get(glass_type, glass_price_m2)
    glass_total_economy = glass_price_m2_economy * length * height

    # === СУФФИКС ПО ЦВЕТУ ===
    color_suffix = {
    "Хром": "",
    "Черная": "b",
    "Бронза": "br",
    "Золото": "g"
    }
    suffix = color_suffix.get(hardware_color, "")


    # === ВСТАВЬ СЮДА КАТАЛОГ ЦЕН SKU ===
    price_catalog_physical = \
    {   '002': {'name': 'Круглая труба', 'price': 2000.0},
        '002b': {'name': 'Круглая труба', 'price': 4000.0},
        '002br': {'name': 'Круглая труба', 'price': 4500.0},
        '002g': {'name': 'Круглая труба', 'price': 4500.0},
        'HF-1': {'name': 'G-профиль', 'price': 12000.0},
        'HF-1b': {'name': 'G-профиль черный', 'price': 14000.0},
        'HF-1br': {'name': 'G-профиль', 'price': 0},
        'HF-1g': {'name': 'G-профиль', 'price': 29000},
        'HF-2': {'name': 'Ролики', 'price': 6000.0},
        'HF-2b': {'name': 'Ролики', 'price': 6000.0},
        'HF-2br': {'name': 'Ролики', 'price': 6000.0},
        'HF-2g': {'name': 'Ролики', 'price': 6000.0},
        'HF-3': {'name': 'Уголок', 'price': 1000.0},
        'HF-3b': {'name': 'Уголок', 'price': 1500.0},
        'HF-3br': {'name': 'G-профиль', 'price': 0},
        'HF-3g': {'name': 'Уголок', 'price': 1500.0},
        'HS-6463': {'name': 'П-образный профиль хром', 'price': 5000.0},
        'HS-6463b': {'name': 'П-образный профиль черный', 'price': 5500.0},
        'HS-6463br': {'name': 'П-образный профиль хром', 'price': 0},
        'HS-6463g': {'name': 'П-образный профиль золото', 'price': 6000.0},
        'HSK-1': {'name': 'Порожек', 'price': 1500.0},
        'HSK-1b': {'name': 'Порожек', 'price': 2000.0},
        'HSK-1br': {'name': 'Порожек', 'price': 3000.0},
        'HSK-1g': {'name': 'Порожек', 'price': 3000.0},
        'HSK-2': {   'name': 'Настенный профиль для магнитного уплотнителя, длина 2,5 метра',
                    'price': 9000.0},
        'HSK-2b': {   'name': 'Настенный профиль для магнитного уплотнителя, длина 2,5 метра',
                    'price': 11000.0},
        'HSK-2br': {   'name': 'Настенный профиль для магнитного уплотнителя, длина 2,5 метра',
                    'price': 7000},
        'HSK-2g': {   'name': 'Настенный профиль для магнитного уплотнителя, длина 2,5 метра',
                    'price': 13000.0},
        'J10255-19': {'name': 'Ручка полотенцесущитель круг', 'price': 4500.0},
        'J10255-19b': {'name': 'Ручка полотенцесущитель круг', 'price': 5000},
        'J10255-19br': {'name': 'Ручка полотенцесущитель круг', 'price': 6000.0},
        'J10255-19g': {'name': 'Ручка полотенцесущитель круг', 'price': 6000.0},
        'J10265': {'name': 'Ручка полотенцесущитель квадрат', 'price': 5500.0},
        'J10265b': {'name': 'Ручка полотенцесущитель квадрат', 'price': 6000.0},
        'J10265br': {'name': 'Ручка полотенцесущитель квадрат', 'price': 6500.0},
        'J10265g': {'name': 'Ручка полотенцесущитель квадрат', 'price': 6500.0},
        'J10270': {'name': 'Скоба квадрат', 'price': 5000.0},
        'J10270b': {'name': 'Скоба квадрат', 'price': 5500.0},
        'J10270br': {'name': 'Скоба квадрат', 'price': 5500.0},
        'J10270g': {'name': 'Скоба квадрат', 'price': 5500.0},
        'J10275': {'name': 'Скоба круг', 'price': 3000.0},
        'J10275b': {'name': 'Ручка - скоба', 'price': 3500.0},
        'J10275br': {'name': 'Ручка - скоба', 'price': 4000.0},
        'J10275g': {'name': 'Ручка - скоба', 'price': 4000.0},
        'J10333': {'name': 'Кноб круг', 'price': 2200.0},
        'J10333b': {'name': 'Ручка-кноб', 'price': 2500.0},
        'J10333br': {'name': 'Ручка-кноб', 'price': 2500.0},
        'J10333g': {'name': 'Ручка-кноб', 'price': 2500.0},
        'J10347': {'name': 'Кноб квадрат', 'price': 2500.0},
        'J10347b': {'name': 'Кноб квадрат', 'price': 3000.0},
        'J10347br': {'name': 'Кноб квадрат', 'price': 3000.0},
        'J10347g': {'name': 'Кноб квадрат', 'price': 3000.0},
        'L10058': {'name': 'Зажим (завершающий) труба-стекло', 'price': 3000.0},
        'L10058b': {'name': 'Зажим (завершающий) труба-стекло', 'price': 4000.0},
        'L10058br': {'name': 'Зажим (завершающий) труба-стекло', 'price': 4000.0},
        'L10058g': {'name': 'Зажим (завершающий) труба-стекло', 'price': 4000.0},
        'L10072': {'name': 'Флянец труба-стена', 'price': 1500.0},
        'L10072b': {'name': 'Зажим (прищепка)', 'price': 2000.0},
        'L10072br': {'name': 'Зажим (прищепка)', 'price': 2000.0},
        'L10072g': {'name': 'Зажим (прищепка)', 'price': 2000.0},
        'L10073': {'name': 'Зажим (прищепка)', 'price': 2000.0},
        'L10073b': {'name': 'Флянец труба-стена', 'price': 2500.0},
        'L10073br': {'name': 'Флянец труба-стена', 'price': 2500.0},
        'L10073g': {'name': 'Флянец труба-стена', 'price': 2500.0},
        'L10074': {'name': 'Углововй соединитель (поворотка)', 'price': 2000.0},
        'L10074b': {'name': 'Углововй соединитель (поворотка)', 'price': 2500.0},
        'L10074br': {'name': 'Углововй соединитель (поворотка)', 'price': 2500.0},
        'L10074g': {'name': 'Углововй соединитель (поворотка)', 'price': 2500.0},
        'L10075': {'name': 'Зажим (прищепка)', 'price': 2500.0},
        'L10075b': {'name': 'Зажим (прищепка)', 'price': 3500.0},
        'L10075br': {'name': 'Зажим (прищепка)', 'price': 3500.0},
        'L10075g': {'name': 'Зажим (прищепка)', 'price': 3500.0},
        'L10078': {'name': 'Флянец труба-стена с углом 45º, 19 мм', 'price': 1000.0},
        'L10078b': {'name': 'Флянец труба-стена с углом 45º, 19 мм', 'price': 1500.0},
        'L10078br': {'name': 'Флянец труба-стена с углом 45º, 19 мм', 'price': 2000.0},
        'L10078g': {'name': 'Флянец труба-стена с углом 45º, 19 мм', 'price': 2000.0},
        'L10079': {'name': 'Зажим (завершающий) труба-стекло', 'price': 3000.0},
        'L10079b': {'name': 'Зажим (завершающий) труба-стекло', 'price': 3500.0},
        'L10079br': {'name': 'Зажим (завершающий) труба-стекло', 'price': 3500.0},
        'L10079g': {'name': 'Зажим (завершающий) труба-стекло', 'price': 3500.0},
        'L10081': {'name': 'Углововй соединитель (поворотка)', 'price': 3000.0},
        'L10081b': {'name': 'Углововй соединитель (поворотка)', 'price': 3500.0},
        'L10081br': {'name': 'Углововй соединитель (поворотка)', 'price': 4000.0},
        'L10081g': {'name': 'Углововй соединитель (поворотка)', 'price': 4000.0},
        'L10083': {'name': 'Зажим (прищепка)', 'price': 3000.0},
        'L10083b': {'name': 'Зажим (прищепка)', 'price': 3500.0},
        'L10083br': {'name': 'Зажим (прищепка)', 'price': 3500.0},
        'L10083g': {'name': 'Зажим (прищепка)', 'price': 3500.0},
        'L10084': {'name': 'Зажим (прищепка)', 'price': 2500.0},
        'L10084b': {'name': 'Зажим (прищепка)', 'price': 3000.0},
        'L10084br': {'name': 'Зажим (прищепка)', 'price': 3000.0},
        'L10084g': {'name': 'Зажим (прищепка)', 'price': 3000.0},
        'L10086': {'name': 'Флянец труба-стена', 'price': 2000.0},
        'L10086b': {'name': 'Флянец труба-стена', 'price': 2500.0},
        'L10086br': {'name': 'Флянец труба-стена', 'price': 2500.0},
        'L10086g': {'name': 'Флянец труба-стена', 'price': 2500.0},
        'L10091': {   'name': 'Угловой соединитель для квадратной трубы регулируемый, 30*10',
                    'price': 3500.0},
        'L10091b': {   'name': 'Угловой соединитель для квадратной трубы регулируемый, 30*10',
                    'price': 4000.0},
        'L10091br': {   'name': 'Угловой соединитель для квадратной трубы регулируемый, 30*10',
                        'price': 4000.0},
        'L10091g': {   'name': 'Угловой соединитель для квадратной трубы регулируемый, 30*10',
                    'price': 4000.0},
        'P10049': {'name': 'Навес гармошка', 'price': 3500},
        'P10049b': {'name': 'Навес гармошка', 'price': 4500},
        'P10049br': {'name': 'Навес гармошка', 'price': 4500},
        'P10049g': {'name': 'Навес гармошка', 'price': 4500},
        'P10050': {'name': 'Без наименования', 'price': 4000},
        'P10050b': {'name': 'Без наименования', 'price': 5000},
        'P10050br': {'name': 'Без наименования', 'price': 5000},
        'P10050g': {'name': 'Без наименования', 'price': 5000},
        'P10086': {'name': 'Навес стена/стекло', 'price': 4500.0},
        'P10086b': {'name': 'Навес стена/стекло', 'price': 5000.0},
        'P10086br': {'name': 'Навес стена/стекло', 'price': 5200.0},
        'P10086g': {'name': 'Навес стена/стекло', 'price': 5200.0},
        'P10088': {'name': 'Навес стекло/стекло 180', 'price': 6000.0},
        'P10088b': {'name': 'Навес стекло/стекло 180', 'price': 6600.0},
        'P10088br': {'name': 'Навес стекло/стекло 180', 'price': 6600.0},
        'P10088g': {'name': 'Навес стекло/стекло 180', 'price': 6600.0},
        'P10089': {'name': 'Навес стекло/стекло 135градусов', 'price': 6000.0},
        'P10089b': {'name': 'Навес стекло/стекло 135градусов', 'price': 6600.0},
        'P10089br': {'name': 'Навес стекло/стекло 135градусов', 'price': 6600.0},
        'P10089g': {'name': 'Навес стекло/стекло 135градусов', 'price': 6600.0},
        'P10090': {'name': 'Навес стекло/стекло 90градусов', 'price': 6000.0},
        'P10090b': {'name': 'Навес стекло/стекло 90градусов', 'price': 6600.0},
        'P10090br': {'name': 'Навес стекло/стекло 90градусов', 'price': 6600.0},
        'P10090g': {'name': 'Навес стекло/стекло 90градусов', 'price': 6600.0},
        'Q10049': {'name': 'Навес гармошка', 'price': 3500},
        'Q10066': {'name': 'Коннектор П-образный', 'price': 1600.0},
        'Q10066b': {'name': 'Коннектор П-образный', 'price': 2000},
        'Q10066br': {'name': 'Коннектор П-образный', 'price': 2000},
        'Q10066g': {'name': 'Коннектор П-образный', 'price': 2000},
        'Q10068': {'name': 'Коннектор Г-образный', 'price': 2000.0},
        'Q10068b': {'name': 'Коннектор Г-образный', 'price': 2500},
        'Q10068br': {'name': 'Коннектор Г-образный', 'price': 2500},
        'Q10068g': {'name': 'Коннектор Г-образный', 'price': 2500},
        'Q10070': {'name': 'Коннектор стена-стекло угловой 135°', 'price': 2500.0},
        'Q10070b': {'name': 'Коннектор стена-стекло угловой 135°', 'price': 3000.0},
        'Q10070br': {'name': 'Коннектор стена-стекло угловой 135°', 'price': 2500},
        'Q10070g': {'name': 'Коннектор стена-стекло угловой 135°', 'price': 2500},
        'Q10078': {'name': 'Коннектор стекло-стекло угловая', 'price': 2500.0},
        'Q10078b': {'name': 'Коннектор стекло-стекло угловая', 'price': 3000},
        'Q10078br': {'name': 'Коннектор стекло-стекло угловая', 'price': 3000},
        'Q10078g': {'name': 'Коннектор стекло-стекло угловая', 'price': 3000},
        'S10001': {'name': 'Штанга для пространственной жесткости круглая', 'price': 4000.0},
        'S10001b': {'name': 'Штанга для пространственной жесткости круглая', 'price': 6000.0},
        'S10001br': {'name': 'Штанга для пространственной жесткости круглая', 'price': 6000.0},
        'S10001g': {'name': 'Штанга для пространственной жесткости круглая', 'price': 6000.0},
        'S10012': {'name': 'Штанга для пространственной жесткости квадратная', 'price': 10000.0},
        'S10012b': {'name': 'Штанга для пространственной жесткости квадратная', 'price': 12000.0},
        'S10012br': {'name': 'Штанга для пространственной жесткости квадратная', 'price': 12000.0},
        'S10012g': {'name': 'Штанга для пространственной жесткости квадратная', 'price': 12000.0},
        'U10025': {'name': 'Уплотнитель магнитный 90/180', 'price': 3000.0},
        'U10025-3': {'name': 'Уплотнитель магнитный 90/180 3 метра', 'price': 4500.0},
        'U10025b': {'name': 'Уплотнитель магнитный 90/180', 'price': 3500.0},
        'U10025br': {'name': 'Уплотнитель магнитный 90/180', 'price': 3500.0},
        'U10025g': {'name': 'Уплотнитель магнитный 90/180', 'price': 5000.0},
        'U10028': {'name': 'Без наименования', 'price': 3000.0},
        'U10028b': {'name': 'Без наименования', 'price': 3500.0},
        'U10028br': {'name': 'Без наименования', 'price': 3000.0},
        'U10028g': {'name': 'Без наименования', 'price': 3000.0},
        'U10032': {'name': 'Уплотнитель магнитный 135°, 8 мм, 2,2 метра', 'price': 3000.0},
        'U10032b': {'name': 'Уплотнитель магнитный 135°, 8 мм, 2,2 метра', 'price': 3500.0},
        'U10032br': {'name': 'Уплотнитель магнитный 135°, 8 мм, 2,2 метра', 'price': 3000.0},
        'U10032g': {'name': 'Уплотнитель магнитный 135°, 8 мм, 2,2 метра', 'price': 5000.0},
        'U10072': {'name': 'Уплотнитель ресничка', 'price': 900.0},
        'U10072b': {'name': 'Уплотнитель ресничка', 'price': 1000.0},
        'U10072br': {'name': 'Уплотнитель ресничка', 'price': 900.0},
        'U10072g': {'name': 'Уплотнитель ресничка', 'price': 900.0},
        'U10075': {   'name': 'Уплотнитель силиконовый для раздвижных дверей, 8 мм, 2,2 м, длина '
                            'хлястика 16 мм',
                    'price': 900.0},
        'U10075b': {   'name': 'Уплотнитель силиконовый для раздвижных дверей, 8 мм, 2,2 м, длина '
                            'хлястика 16 мм',
                    'price': 1000.0},
        'U10075br': {   'name': 'Уплотнитель силиконовый для раздвижных дверей, 8 мм, 2,2 м, длина '
                                'хлястика 16 мм',
                        'price': 900.0},
        'U10075g': {   'name': 'Уплотнитель силиконовый для раздвижных дверей, 8 мм, 2,2 м, длина '
                            'хлястика 16 мм',
                    'price': 900.0},
        'U10084': {'name': 'Уплотнитель силиконовый (полусфера), 8 мм, 2,2 метра', 'price': 900.0},
        'U10084b': {'name': 'Уплотнитель силиконовый (полусфера), 8 мм, 2,2 метра', 'price': 1000.0},
        'U10084br': {'name': 'Уплотнитель силиконовый (полусфера), 8 мм, 2,2 метра', 'price': 900.0},
        'U10084g': {'name': 'Уплотнитель силиконовый (полусфера), 8 мм, 2,2 метра', 'price': 900.0},
        'WXD-101': {'name': 'Комп. Фур. для раздв-й системы', 'price': 20000.0},
        'WXD-101b': {'name': 'Комп. Фур. для раздв-й системы', 'price': 22000.0},
        'WXD-101br': {'name': 'Комп. Фур. для раздв-й системы', 'price': 22000.0},
        'WXD-101g': {'name': 'Комп. Фур. для раздв-й системы', 'price': 22000.0},
        'Покуп': {'name': 'Крышка на П-профиль', 'price': 3000.0},
        'Покуп-b': {'name': 'Крышка на П-профиль', 'price': 3500.0},
        'Покуп-br': {'name': 'Крышка на П-профиль', 'price': 3500},
        'Покуп-g': {'name': 'Крышка на П-профиль', 'price': 3500}}


    price_catalog_legal = {
    '002': {'name':  'Круглая труба', 'price': 2000},
    '002b': {'name':  'Круглая труба', 'price': 4000},
    '002br': {'name':  'Круглая труба', 'price': 4500},
    '002g': {'name':  'Круглая труба', 'price': 4500},
    'HF-1': {'name':  'G-профиль', 'price': 12000},
    'HF-1b': {'name':  'G-профиль', 'price': 14000},
    'HF-1br': {'name':  'G-профиль', 'price': 0},
    'HF-1g': {'name':  'G-профиль', 'price': 29000},
    'HF-2': {'name':  'G-профиль', 'price': 6000},
    'HF-2b': {'name':  'G-профиль', 'price': 6000},
    'HF-2br': {'name':  'G-профиль', 'price': 6000},
    'HF-2g': {'name':  'G-профиль', 'price': 6000},
    'HF-3': {'name':  'G-профиль', 'price': 1000},
    'HF-3b': {'name':  'G-профиль', 'price': 1500},
    'HF-3br': {'name':  'G-профиль', 'price': 0},
    'HF-3g': {'name':  'G-профиль', 'price': 1500},
    'HS-6463': {'name':  'П-образный профиль хром', 'price': 5000},
    'HS-6463b': {'name':  'П-образный профиль хром', 'price': 5500},
    'HS-6463br': {'name':  'П-образный профиль хром', 'price': 0},
    'HS-6463g': {'name':  'П-образный профиль хром', 'price': 6000},
    'HSK-1': {'name':  'Порожек', 'price': 1500},
    'HSK-1b': {'name':  'Порожек', 'price': 2000},
    'HSK-1br': {'name':  'Порожек', 'price': 3000},
    'HSK-1g': {'name':  'Порожек', 'price': 3000},
    'HSK-2': {'name':  'Настенный профиль для магнитного уплотнителя, длина 2,5 метра', 'price': 9000},
    'HSK-2b': {'name':  'Настенный профиль для магнитного уплотнителя, длина 2,5 метра', 'price': 11000},
    'HSK-2br': {'name':  'Настенный профиль для магнитного уплотнителя, длина 2,5 метра', 'price': 0},
    'HSK-2g': {'name':  'Настенный профиль для магнитного уплотнителя, длина 2,5 метра', 'price': 13000},
    'J10255-19': {'name':  'Ручка полотенцесущитель круг', 'price': 4500},
    'J10255-19b': {'name':  'Ручка полотенцесущитель круг', 'price': 5000},
    'J10255-19br': {'name':  'Ручка полотенцесущитель круг', 'price': 6000},
    'J10255-19g': {'name':  'Ручка полотенцесущитель круг', 'price': 6000},
    'J10265': {'name':  'Ручка полотенцесущитель квадрат', 'price': 5500},
    'J10265b': {'name':  'Ручка полотенцесущитель квадрат', 'price': 6000},
    'J10265br': {'name':  'Ручка полотенцесущитель квадрат', 'price': 6500},
    'J10265g': {'name':  'Ручка полотенцесущитель квадрат', 'price': 6500},
    'J10270': {'name':  'Скоба квадрат', 'price': 5000},
    'J10270b': {'name':  'Скоба квадрат', 'price': 5500},
    'J10270br': {'name':  'Скоба квадрат', 'price': 5500},
    'J10270g': {'name':  'Скоба квадрат', 'price': 5500},
    'J10275': {'name':  'Скоба круг', 'price': 3000},
    'J10275b': {'name':  'Ручка - скоба', 'price': 3500},
    'J10275br': {'name':  'Ручка - скоба', 'price': 4000},
    'J10275g': {'name':  'Ручка - скоба', 'price': 4000},
    'J10333': {'name':  'Кноб круг', 'price': 2200},
    'J10333b': {'name':  'Ручка-кноб', 'price': 2500},
    'J10333br': {'name':  'Ручка-кноб', 'price': 2500},
    'J10333g': {'name':  'Ручка-кноб', 'price': 2500},
    'J10347': {'name':  'Кноб квадрат', 'price': 2500},
    'J10347b': {'name':  'Кноб квадрат', 'price': 3000},
    'J10347br': {'name':  'Кноб квадрат', 'price': 3000},
    'J10347g': {'name':  'Кноб квадрат', 'price': 3000},
    'L10058': {'name':  'Зажим завершающий труба-стекло', 'price': 3000},
    'L10058': {'name':  'Зажим завершающий труба-стекло', 'price': 3000},
    'L10058b': {'name':  'Зажим завершающий труба-стекло', 'price': 4000},
    'L10058b': {'name':  'Зажим завершающий труба-стекло', 'price': 4000},
    'L10058br': {'name':  'Зажим завершающий труба-стекло', 'price': 4000},
    'L10058br': {'name':  'Зажим завершающий труба-стекло', 'price': 4000},
    'L10058g': {'name':  'Зажим завершающий труба-стекло', 'price': 4000},
    'L10058g': {'name':  'Зажим завершающий труба-стекло', 'price': 4000},
    'L10072': {'name':  'Флянец труба-стена', 'price': 1500},
    'L10072b': {'name':  'Флянец труба-стена', 'price': 2000},
    'L10072br': {'name':  'Флянец труба-стена', 'price': 2000},
    'L10072g': {'name':  'Флянец труба-стена', 'price': 2000},
    'L10073': {'name':  'Зажим прищепка', 'price': 2000},
    'L10073b': {'name':  'Зажим прищепка', 'price': 2500},
    'L10073br': {'name':  'Зажим прищепка', 'price': 2500},
    'L10073g': {'name':  'Зажим прищепка', 'price': 2500},
    'L10074': {'name':  'Углововй соединитель поворотка ', 'price': 2000},
    'L10074b': {'name':  'Углововй соединитель поворотка ', 'price': 2500},
    'L10074br': {'name':  'Углововй соединитель поворотка ', 'price': 2500},
    'L10074g': {'name':  'Углововй соединитель поворотка ', 'price': 2500},
    'L10075': {'name':  'Зажим прищепка', 'price': 2500},
    'L10075b': {'name':  'Зажим прищепка', 'price': 3500},
    'L10075br': {'name':  'Зажим прищепка', 'price': 3500},
    'L10075g': {'name':  'Зажим прищепка', 'price': 3500},
    'L10078': {'name':  'Флянец труба-стена с углом 45º, 19 мм', 'price': 1000},
    'L10078b': {'name':  'Флянец труба-стена с углом 45º, 19 мм', 'price': 1500},
    'L10078br': {'name':  'Флянец труба-стена с углом 45º, 19 мм', 'price': 2000},
    'L10078g': {'name':  'Флянец труба-стена с углом 45º, 19 мм', 'price': 2000},
    'L10079': {'name':  'Зажим завершающий труба-стекло', 'price': 3000},
    'L10079b': {'name':  'Зажим завершающий труба-стекло', 'price': 3500},
    'L10079br': {'name':  'Зажим завершающий труба-стекло', 'price': 3500},
    'L10079g': {'name':  'Зажим завершающий труба-стекло', 'price': 3500},
    'L10081': {'name':  'Углововй соединитель поворотка ', 'price': 3000},
    'L10081b': {'name':  'Углововй соединитель поворотка ', 'price': 3500},
    'L10081br': {'name':  'Углововй соединитель поворотка ', 'price': 4000},
    'L10081g': {'name':  'Углововй соединитель поворотка ', 'price': 4000},
    'L10083': {'name':  'Зажим прищепка', 'price': 3000},
    'L10083b': {'name':  'Зажим прищепка', 'price': 3500},
    'L10083br': {'name':  'Зажим прищепка', 'price': 3500},
    'L10083g': {'name':  'Зажим прищепка', 'price': 3500},
    'L10084': {'name':  'Зажим прищепка', 'price': 2500},
    'L10084b': {'name':  'Зажим прищепка', 'price': 3000},
    'L10084br': {'name':  'Зажим прищепка', 'price': 3000},
    'L10084g': {'name':  'Зажим прищепка', 'price': 3000},
    'L10086': {'name':  'Флянец труба-стена', 'price': 2000},
    'L10086b': {'name':  'Флянец труба-стена', 'price': 2500},
    'L10086br': {'name':  'Флянец труба-стена', 'price': 2500},
    'L10086g': {'name':  'Флянец труба-стена', 'price': 2500},
    'L10091': {'name':  'Угловой соединитель для квадратной трубы регулируемый, 30*10', 'price': 3500},
    'L10091b': {'name':  'Угловой соединитель для квадратной трубы регулируемый, 30*11', 'price': 4000},
    'L10091br': {'name':  'Угловой соединитель для квадратной трубы регулируемый, 30*12', 'price': 4000},
    'L10091g': {'name':  'Угловой соединитель для квадратной трубы регулируемый, 30*13', 'price': 4000},
    'Q10049': {'name':  'Навес гармошка', 'price': 3500},
    'P10049b': {'name':  'Навес гармошка', 'price': 4500},
    'P10049br': {'name':  'Навес гармошка', 'price': 0},
    'P10049g': {'name':  'Навес гармошка', 'price': 0},
    'P10050': {'name':  'Без наименования', 'price': 4000},
    'P10050b': {'name':  'Без наименования', 'price': 5000},
    'P10050br': {'name':  'Без наименования', 'price': 0},
    'P10050g': {'name':  'Без наименования', 'price': 0},
    'P10086': {'name':  'Навес стена/стекло', 'price': 4500},
    'P10086b': {'name':  'Навес стена/стекло', 'price': 5000},
    'P10086br': {'name':  'Навес стена/стекло', 'price': 5200},
    'P10086g': {'name':  'Навес стена/стекло', 'price': 5200},
    'P10088': {'name':  'Навес стекло/стекло 180', 'price': 6000},
    'P10088b': {'name':  'Навес стекло/стекло 180', 'price': 6600},
    'P10088br': {'name':  'Навес стекло/стекло 180', 'price': 6600},
    'P10088g': {'name':  'Навес стекло/стекло 180', 'price': 6600},
    'P10089': {'name':  'Навес стекло/стекло 135градусов', 'price': 6000},
    'P10089b': {'name':  'Навес стекло/стекло 135градусов', 'price': 6600},
    'P10089br': {'name':  'Навес стекло/стекло 135градусов', 'price': 6600},
    'P10089g': {'name':  'Навес стекло/стекло 135градусов', 'price': 6600},
    'P10090': {'name':  'Навес стекло/стекло 90градусов', 'price': 6000},
    'P10090b': {'name':  'Навес стекло/стекло 90градусов', 'price': 6600},
    'P10090br': {'name':  'Навес стекло/стекло 90градусов', 'price': 6600},
    'P10090g': {'name':  'Навес стекло/стекло 90градусов', 'price': 6600},
    'Q10066': {'name':  'Коннектор П-образный', 'price': 1600},
    'Q10066b': {'name':  'Коннектор П-образный', 'price': 2000},
    'Q10066br': {'name':  'Коннектор П-образный', 'price': 2000},
    'Q10066g': {'name':  'Коннектор П-образный', 'price': 2000},
    'Q10068': {'name':  'Коннектор Г-образный', 'price': 2000},
    'Q10068b': {'name':  'Коннектор Г-образный', 'price': 2500},
    'Q10068br': {'name':  'Коннектор Г-образный', 'price': 2500},
    'Q10068g': {'name':  'Коннектор Г-образный', 'price': 2500},
    'Q10070': {'name':  'Коннектор стена-стекло угловой 135°', 'price': 2500},
    'Q10070b': {'name':  'Коннектор стена-стекло угловой 135°', 'price': 3000},
    'Q10070br': {'name':  'Коннектор стена-стекло угловой 135°', 'price': 0},
    'Q10070g': {'name':  'Коннектор стена-стекло угловой 135°', 'price': 0},
    'Q10078': {'name':  'Коннектор стекло-стекло угловая', 'price': 2500},
    'Q10078b': {'name':  'Коннектор стекло-стекло угловая', 'price': 3000},
    'Q10078br': {'name':  'Коннектор стекло-стекло угловая', 'price': 3000},
    'Q10078g': {'name':  'Коннектор стекло-стекло угловая', 'price': 3000},
    'S10001': {'name':  'Штанга для пространственной жесткости круглая', 'price': 4000},
    'S10001b': {'name':  'Штанга для пространственной жесткости круглая', 'price': 6000},
    'S10001br': {'name':  'Штанга для пространственной жесткости круглая', 'price': 6000},
    'S10001g': {'name':  'Штанга для пространственной жесткости круглая', 'price': 6000},
    'S10012': {'name':  'Штанга для пространственной жесткости квадратная', 'price': 10000},
    'S10012b': {'name':  'Штанга для пространственной жесткости квадратная', 'price': 12000},
    'S10012br': {'name':  'Штанга для пространственной жесткости квадратная', 'price': 12000},
    'S10012g': {'name':  'Штанга для пространственной жесткости квадратная', 'price': 12000},
    'U10025': {'name':  'Уплотнитель магнитный 90/180', 'price': 3000},
    'U10025-3': {'name':  'Уплотнитель магнитный 90/180 3 метра', 'price': 4000},
    'U10025b': {'name':  'Уплотнитель магнитный 90/180', 'price': 3500},
    'U10025-3': {'name':  'Уплотнитель магнитный 90/180 3 метра', 'price': 4500},
    'U10025br': {'name':  'Уплотнитель магнитный 90/180', 'price': 3500},
    'U10025g': {'name':  'Уплотнитель магнитный 90/180', 'price': 5000},
    'U10028': {'name':  'Без наименования', 'price': 3000},
    'U10028b': {'name':  'Без наименования', 'price': 3500},
    'U10028br': {'name':  'Без наименования', 'price': 3000},
    'U10028g': {'name':  'Без наименования', 'price': 3000},
    'U10032': {'name':  'Уплотнитель магнитный 135°, 8 мм, 2,2 метра', 'price': 3000},
    'U10032b': {'name':  'Уплотнитель магнитный 135°, 8 мм, 2,2 метра', 'price': 3500},
    'U10032br': {'name':  'Уплотнитель магнитный 135°, 8 мм, 2,2 метра', 'price': 3000},
    'U10032g': {'name':  'Уплотнитель магнитный 135°, 8 мм, 2,2 метра', 'price': 5000},
    'U10072': {'name':  'Уплотнитель ресничка', 'price': 900},
    'U10072b': {'name':  'Уплотнитель ресничка', 'price': 1000},
    'U10072br': {'name':  'Уплотнитель ресничка', 'price': 900},
    'U10072g': {'name':  'Уплотнитель ресничка', 'price': 900},
    'U10075': {'name':  'Уплотнитель силиконовый для раздвижных дверей, 8 мм, 2,2 м, длина хлястика 16 мм', 'price': 900},
    'U10075b': {'name':  'Уплотнитель силиконовый для раздвижных дверей, 8 мм, 2,2 м, длина хлястика 16 мм', 'price': 1000},
    'U10075br': {'name':  'Уплотнитель силиконовый для раздвижных дверей, 8 мм, 2,2 м, длина хлястика 16 мм', 'price': 900},
    'U10075g': {'name':  'Уплотнитель силиконовый для раздвижных дверей, 8 мм, 2,2 м, длина хлястика 16 мм', 'price': 900},
    'U10084': {'name':  'Уплотнитель силиконовый полусфера, 8 мм, 2,2 метра', 'price': 900},
    'U10084b': {'name':  'Уплотнитель силиконовый полусфера, 8 мм, 2,2 метра', 'price': 1000},
    'U10084br': {'name':  'Уплотнитель силиконовый полусфера, 8 мм, 2,2 метра', 'price': 900},
    'U10084g': {'name':  'Уплотнитель силиконовый полусфера, 8 мм, 2,2 метра', 'price': 900},
    'WXD-101': {'name':  'Комп. Фур. для раздв-й системы', 'price': 20000},
    'WXD-101b': {'name':  'Комп. Фур. для раздв-й системы', 'price': 22000},
    'WXD-101br': {'name':  'Комп. Фур. для раздв-й системы', 'price': 22000},
    'WXD-101g': {'name':  'Комп. Фур. для раздв-й системы', 'price': 22000},
    'Покуп': {'name':  'Крышка на П-профиль', 'price': 3000},
    'Покуп-b': {'name':  'Крышка на П-профиль', 'price': 3500},
    'Покуп-br': {'name':  'Крышка на П-профиль', 'price': 3500},
    'Покуп-g': {'name':  'Крышка на П-профиль', 'price': 3500},
    }

    # === ВСПОМОГАТЕЛЬНАЯ ФУНКЦИЯ ОКРУГЛЕНИЯ КАК В EXCEL ===
    def roundup_excel(value):
        val = float(value)
        return int(val) + (1 if val % 1 != 0 else 0)

    # === ОБЩИЙ РАСЧЁТ ДЛЯ ВСЕХ ТИПОВ ===

    # Кол-во профиля по общей формуле
    def count_profile_qty(length, height):
        return roundup_excel(length) + roundup_excel(height) * 2

    rounded_qty = count_profile_qty(length, height)

    # Excel-подобные формулы из таблиц (F8–F12)
    f8 = (length + height * 2) / 2.5 - 1
    f9 = (length + height * 2) / 2.5
    f10 = (length + height * 2) / 2.5
    f11 = (length + height) / 2.5
    f12 = (length + height * 2) / 2.5

    rounded_f8  = roundup_excel(f8)
    rounded_f9  = roundup_excel(f9)
    rounded_f10 = roundup_excel(f10)
    rounded_f11 = roundup_excel(f11)
    rounded_f12 = roundup_excel(f12)


    # === РАЗВЕТВЛЕНИЕ ПО ТИПУ КОНСТРУКЦИИ ===
    # === РАСЧЁТ "П-ОБРАЗНАЯ" ===
    if shower_type == "П-образная":
        sku_map = {
            "A8": f"P10088{suffix}",
            "A9": f"Q10078{suffix}",
            "A10": f"HS-6463{suffix}" if mount_type == "На П-профиле" else "-",
            "A11": (
                f"Q10068{suffix}" if connector_type == "Коннектор Г-образный" and mount_type == "На коннекторах" else
                f"Q10066{suffix}" if mount_type == "На коннекторах" else
                "-"
            ),
            "A12": f"L10073{suffix}" if frame_type == "Круглая труба" else f"L10084{suffix}",
            "A13": f"L10072{suffix}" if frame_type == "Круглая труба" else f"L10086{suffix}",
            "A14": f"L10074{suffix}" if frame_type == "Круглая труба" else f"L10081{suffix}",
            "A15": f"U10072{suffix}",
            "A16": f"U10025{suffix}",
            "A17": (
                f"J10255-19{suffix}" if handle_type == "Ручка полотенцесушитель" and frame_type == "Круглая труба" else
                f"J10265{suffix}" if handle_type == "Ручка полотенцесушитель" else
                f"J10275{suffix}" if handle_type == "Скоба" and frame_type == "Круглая труба" else
                f"J10270{suffix}" if handle_type == "Скоба" else
                f"J10333{suffix}" if frame_type == "Круглая труба" else
                f"J10347{suffix}"
            ),
            "A18": (
                f"HSK-1{suffix}" if bottom_element == "Порожек" else
                f"Покуп{('-' + suffix) if suffix else ''}" if bottom_element == "Крышка на П-профиль" else
                "-"
            )
        }
        debug(f"[Проверка A14] door_position: {door_position!r}")
        sku_qty = {
            "A8": 2,
            "A9": 2 if door_position == "С боку" else 4,
            "A10": (
                rounded_f12
                if mount_type == "На П-профиле" else 0
            ),
            "A11": (
                10 if mount_type == "На коннекторах" and door_position == "С боку" else
                12 if mount_type == "На коннекторах" and door_position == "По середине" else
                0
            ),
            "A12": (
                3 if door_position == "С боку" else
                4 if door_position == "По середине" else
                0
            ),
            "A13": 2,
            "A14": 2,
            "A15": 2 if mount_type == "На П-профиле" else 6,
            "A16": 1,
            "A17": 1,
            "A18": 1 if sku_map.get("A18", "-") != "-" else 0
        }

    elif shower_type == "Угловая распашная":
        # === ВСПОМОГАТЕЛЬНАЯ ФУНКЦИЯ ДЛЯ ОКРУГЛЕНИЯ КАК В EXCEL ===

        hinge_base_code = "P10090" if door_count == "Одна от стекла 90" else "P10088"
        rounded_qty = roundup_excel((length + height * 2) / 2.5)

        sku_map = {
            "AA9": f"{hinge_base_code}{suffix}",
            "AA10": f"HS-6463{suffix}" if mount_type == "На П-профиле" else "-",
            "AA11": (
                f"Q10068{suffix}" if mount_type == "На коннекторах" and connector_type == "Коннектор Г-образный"
                else f"Q10066{suffix}" if mount_type == "На коннекторах" and connector_type == "Коннектор П-образный"
                else "-"
            ),
            "AA12": (
                f"L10073{suffix}" if frame_type == "Круглая труба" and binding_type == "По периметру"
                else f"L10084{suffix}" if frame_type == "Квадратная труба" and binding_type == "По периметру"
                else f"L10075{suffix}" if frame_type == "Круглая труба"
                else f"L10083{suffix}"
            ),
            "AA13": f"L10072{suffix}" if frame_type == "Круглая труба" else f"L10086{suffix}",
            "AA14": (
                f"L10074{suffix}" if frame_type == "Круглая труба" and binding_type == "По периметру"
                else f"L10081{suffix}" if frame_type == "Квадратная труба" and binding_type == "По периметру"
                else f"L10058{suffix}" if frame_type == "Круглая труба"
                else f"L10079{suffix}"
            ),
            "AA15": f"U10072{suffix}",
            "AA16": f"U10025{suffix}",
            "AA17": (
                f"J10255-19{suffix}" if handle_type == "Ручка полотенцесушитель" and frame_type == "Круглая труба"
                else f"J10265{suffix}" if handle_type == "Ручка полотенцесушитель" and frame_type == "Квадратная труба"
                else f"J10275{suffix}" if handle_type == "Скоба" and frame_type == "Круглая труба"
                else f"J10270{suffix}" if handle_type == "Скоба" and frame_type == "Квадратная труба"
                else f"J10333{suffix}" if frame_type == "Круглая труба"
                else f"J10347{suffix}"
            ),
            "AA18": (
                f"HSK-1{suffix}" if bottom_element == "Порожек"
                else f"Покуп{('-' + suffix) if suffix else ''}" if bottom_element == "Крышка на П-профиль"
                else "-"
            )
        }

        sku_qty = {
            "AA9" : (
                4 if door_count == "Две" and binding_type == "По периметру" else
                0 if door_count == "Две" and binding_type == "С одной стороны" else
                2
            ),
            "AA10": rounded_f10 if mount_type == "На П-профиле" else 0,
            "AA11": (
                6 if mount_type == "На коннекторах" and door_count == "Одна от стены" else
                0 if mount_type == "На П-профиле" else
                8
            ),
            "AA12": 2 if binding_type == "По периметру" else 1,
            "AA13": 2 if binding_type == "По периметру" else 1,
            "AA14": 1,
            "AA15": (
                5 if door_count == "Две" and binding_type == "По периметру" and mount_type == "На коннекторах" else
                3 if door_count == "Две" and binding_type == "По периметру" and mount_type == "На П-профиле" else
                2 if door_count in ["Одна от стекла 180", "Одна от стекла 90"] and mount_type == "На П-профиле" else
                4 if door_count in ["Одна от стекла 180", "Одна от стекла 90"] and mount_type == "На коннекторах" else
                3 if door_count == "Одна от стены" and mount_type == "На коннекторах" else
                2 if door_count == "Одна от стены" and mount_type == "На П-профиле" else
                0
            ),
            "AA16": 1,
            "AA17": 1 if door_count in ["Одна от стены", "Одна от стекла 180", "Одна от стекла 90"] else 2,
            "AA18": 1 if sku_map["AA18"] != "-" else 0
        }

    elif shower_type == "Угловая раздвижная":
        is_g_profile = frame_type == "G-профиль"
        is_square = frame_type == "Квадратная труба"
        has_magnet_seal = magnet_seal_type == "С магнитным уплотнителем"

        # Округление количества П-профиля (AAA10) по Excel
        f11 = (length + height * 2) / 2.5
        rounded_qty = roundup_excel(f11)

        sku_AAA14 = f"U10025{suffix}" if (is_g_profile or (is_square and has_magnet_seal)) else "-"

        sku_map = {
            "AAA9": f"HF-1{suffix}" if is_g_profile else f"WXD-101{suffix}" if is_square else "-",
            "AAA10": f"HS-6463{suffix}" if mount_type == "На П-профиле" else "-",
            "AAA11": (
                f"Q10068{suffix}" if mount_type == "На коннекторах" and connector_type == "Коннектор Г-образный" else
                f"Q10066{suffix}" if mount_type == "На коннекторах" and connector_type == "Коннектор П-образный" else "-"
            ),
            "AAA12": f"U10072{suffix}" if frame_type in ["G-профиль", "Квадратная труба"] else "-",
            "AAA13": f"U10075{suffix}" if frame_type in ["G-профиль", "Квадратная труба"] else "-",
            "AAA14": sku_AAA14,
            "AAA15": f"L10081{suffix}" if is_square else "-",
            "AAA16": (
                f"HSK-1{suffix}" if bottom_element == "Порожек" else
                f"Покуп{('-' + suffix) if suffix else ''}" if bottom_element == "Крышка на П-профиль" else "-"
            ),
            "AAA17": (
                f"J10255-19{suffix}" if handle_type == "Ручка полотенцесушитель" and is_g_profile else
                f"J10275{suffix}" if handle_type == "Скоба" and is_g_profile else
                f"J10333{suffix}" if handle_type == "Кноб" and is_g_profile else "-"
            ),
            "AAA18": f"HF-2{suffix}" if is_g_profile else "-",
            "AAA19": f"HF-3{suffix}" if is_g_profile else "-"
        }

        sku_qty = {
            "AAA9" : 2 if door_count == "Две" and frame_type == "Квадратная труба" else 1,
            "AAA10": rounded_f11 if mount_type == "На П-профиле" else 0,
            "AAA11": 8 if mount_type == "На коннекторах" else 0,
            "AAA12": 1 if door_count in ["Одна", "Две"] and mount_type == "На П-профиле" else 4,
            "AAA13": 2 if door_count == "Одна" else 4,
            "AAA14": 1 if sku_map["AAA14"] != "-" else 0,
            "AAA15": 1 if frame_type == "Квадратная труба" and magnet_seal_type == "С магнитным уплотнителем" else 0,
            "AAA16": 1,
            "AAA17": (
                1 if door_count == "Одна" and frame_type == "G-профиль" else
                2 if door_count == "Две" and frame_type == "G-профиль" else 0
            ),
            "AAA18": (
                2 if door_count == "Две" and frame_type == "G-профиль" else
                1 if door_count == "Одна" and frame_type == "G-профиль" else 0
            ),
            "AAA19": 1 if frame_type == "G-профиль" else 0
        }
        
    elif shower_type == "Прямая распашная":
        # === ДОП. ПОДСЧЁТ ===
        f10 = (length + height * 2) / 2.5

        # === Excel-совместимое округление количества для HS-6463 ===
        if mount_type == "На П-профиле" and door_position == "От стекла к стеклу":
            qty_hs6463 = roundup_excel(f10)
        else:
            qty_hs6463 = roundup_excel(f10 - 1)

        # === ОСНОВНЫЕ УСЛОВИЯ ===
        hinge_code = "P10086" if door_position == "От стены" else "P10088"
        b10_value = "П-образный профиль" if mount_type == "На П-профиле" else "-"
        b16_value = (
            "Уплотнитель магнитный 90/180"
            if not (door_position == "От стекла к стене" and seal_type == "Полусфера")
            else "-"
        )

        sku_map = {
            "AAAA9": f"{hinge_code}{suffix}",
            "AAAA10": f"HS-6463{suffix}" if mount_type == "На П-профиле" else "-",
            "AAAA11": (
                f"Q10068{suffix}" if mount_type == "На коннекторах" and connector_type == "Коннектор Г-образный" else
                f"Q10066{suffix}" if mount_type == "На коннекторах" and connector_type == "Коннектор П-образный" else "-"
            ),
            "AAAA12": (
                f"L10073{suffix}" if frame_type == "Круглая труба" and binding_position == "Обвязка над стеклом" else
                f"L10084{suffix}" if frame_type == "Квадратная труба" and binding_position == "Обвязка над стеклом" else
                f"L10075{suffix}" if frame_type == "Круглая труба" else
                f"L10083{suffix}"
            ),
            "AAAA13": f"L10072{suffix}" if frame_type == "Круглая труба" else f"L10086{suffix}",
            "AAAA14": (
                f"U10084{suffix}" if door_position == "От стекла к стене" and seal_type == "Полусфера" else
                f"HSK-2{suffix}" if door_position == "От стекла к стене" and seal_type == "Притворная планка" and hardware_color != "Бронза" else "-"
            ),
            "AAAA15": f"U10072{suffix}",
            "AAAA16": f"U10025{suffix}" if b16_value == "Уплотнитель магнитный 90/180" else "-",
            "AAAA17": (
                f"J10255-19{suffix}" if handle_type == "Ручка полотенцесушитель" and frame_type == "Круглая труба" else
                f"J10265{suffix}" if handle_type == "Ручка полотенцесушитель" and frame_type == "Квадратная труба" else
                f"J10275{suffix}" if handle_type == "Скоба" and frame_type == "Круглая труба" else
                f"J10270{suffix}" if handle_type == "Скоба" and frame_type == "Квадратная труба" else
                f"J10333{suffix}" if frame_type == "Круглая труба" else
                f"J10347{suffix}"
            ),
            "AAAA18": (
                f"HSK-1{suffix}" if bottom_element == "Порожек" else
                f"Покуп{('-' + suffix) if suffix else ''}" if bottom_element == "Крышка на П-профиль" else "-"
            )
        }

        sku_qty = {
            "AAAA9" : 2,
            "AAAA10": (
                rounded_f10 if mount_type == "На П-профиле" and door_position == "От стекла к стеклу" else
                max(rounded_f10 - 1, 0) if mount_type == "На П-профиле" else 0
            ),
            "AAAA11": 4 if mount_type == "На коннекторах" else 0,
            "AAAA12": 2 if door_position == "От стекла к стеклу" else 1,
            "AAAA13": 2,
            "AAAA14": 1 if sku_map["AAAA14"] != "-" else 0,
            "AAAA15": (
                3 if door_position == "От стены" and mount_type == "На коннекторах" else
                2 if mount_type == "На П-профиле" else
                4 if door_position == "От стекла к стеклу" and mount_type == "На коннекторах" else 0
            ),
            "AAAA16": 1 if b16_value == "Уплотнитель магнитный 90/180" else 0,
            "AAAA17": 1,
            "AAAA18": 1,
            "CCCC20": 1 if length > 1.7 else 0
        }

    elif shower_type == "Прямая раздвижная":
        f10 = length / 3
        f11 = (length + height * 2) / 2.5

        is_g_profile = frame_type == "G-профиль"
        is_square = frame_type == "Квадратная труба"
        is_double = door_count == "Две"
        is_single = door_count == "Одна"
        is_from_wall = door_position == "От стены"
        is_center = door_position == "По середине"

        b16_value = (
            "-" if is_from_wall and seal_type == "Полусфера" else
            "-" if is_center and is_single else
            "Уплотнитель магнитный 90/180"
        )

        sku_map = {
            "AAAAA10": f"HF-1{suffix}" if is_g_profile else f"WXD-101{suffix}" if is_square else "-",
            "AAAAA11": f"HS-6463{suffix}" if mount_type == "На П-профиле" else "-",
            "AAAAA12": (
                f"Q10068{suffix}" if mount_type == "На коннекторах" and connector_type == "Коннектор Г-образный" else
                f"Q10066{suffix}" if mount_type == "На коннекторах" and connector_type == "Коннектор П-образный" else "-"
            ),
            "AAAAA13": f"U10072{suffix}",
            "AAAAA14": f"U10075{suffix}",
            "AAAAA15": (
                "U10084" if is_from_wall and seal_type == "Полусфера" else
                f"HSK-2{suffix}" if is_from_wall and seal_type == "Притворная планка" and hardware_color != "Бронза" else "-"
            ),
            "AAAAA16": f"U10028{suffix}" if b16_value == "Уплотнитель магнитный 90/180" else "-",
            "AAAAA17": (
                f"J10255-19{suffix}" if handle_type == "Ручка полотенцесушитель" and is_g_profile else
                f"J10275{suffix}" if handle_type == "Скоба" and is_g_profile else
                f"J10333{suffix}" if handle_type == "Кноб" and is_g_profile else "-"
            ),
            "AAAAA18": (
                f"HSK-1{suffix}" if bottom_element == "Порожек" else
                f"Покуп{('-' + suffix) if suffix else ''}" if bottom_element == "Крышка на П-профиль" else "-"
            ),
            "AAAAA19": f"HF-2{suffix}" if is_g_profile else "-"
        }

        sku_qty = {
            "AAAAA10": (
                roundup_excel(length / 3) if frame_type == "G-профиль" else
                2 if frame_type == "Квадратная труба" and door_count == "Две" else
                1 if frame_type == "Квадратная труба" and door_count == "Одна" else 0
            ),
            "AAAAA11": (
                roundup_excel(f11)                 if mount_type == "На П-профиле" and door_position == "По середине" and door_count == "Две" else
                max(roundup_excel(f11 - 1), 0)     if mount_type == "На П-профиле" and door_position == "От стены"     and door_count == "Одна" else
                "Ошибка"                           if mount_type == "На П-профиле" and door_position == "От стены"     and door_count == "Две" else
                roundup_excel(f11)                 if mount_type == "На П-профиле" and door_position == "По середине" and door_count == "Одна" else
                0
            ),
            "AAAAA12": (
                8 if mount_type == "На коннекторах" and door_position == "По середине" and door_count == "Две" else
                4 if mount_type == "На коннекторах" and door_position == "От стены" and door_count == "Одна" else
                8 if mount_type == "На коннекторах" and door_position == "По середине" and door_count == "Одна" else 0
            ),
            "AAAAA13": (
                3 if mount_type == "На коннекторах" and door_position == "По середине" and door_count == "Две" else
                2 if mount_type == "На коннекторах" and door_position == "От стены" and door_count == "Одна" else
                3 if mount_type == "На коннекторах" and door_position == "По середине" and door_count == "Одна" else
                1 if mount_type == "На П-профиле" and door_position == "По середине" and door_count == "Две" else
                1 if mount_type == "На П-профиле" and door_position == "От стены" and door_count == "Одна" else
                1 if mount_type == "На П-профиле" and door_position == "По середине" and door_count == "Одна" else 0
            ),
            "AAAAA14": (
                4 if door_position == "По середине" and door_count == "Две" else
                2 if door_position == "От стены" and door_count == "Одна" else 4
            ),
            "AAAAA15": 1 if sku_map["AAAAA15"] != "-" else 0,
            "AAAAA16": 1 if sku_map["AAAAA16"] != "-" else 0,
            "AAAAA17": (
                1 if door_count == "Одна" and frame_type == "G-профиль" else
                2 if door_count == "Две" and frame_type == "G-профиль" else 0
            ),
            "AAAAA18": 1,
            "AAAAA19": (
                2 if door_count == "Две" and frame_type == "G-профиль" else
                1 if door_count == "Одна" and frame_type == "G-профиль" else 0
            ),
            "CCCCC21": 1 if frame_type == "Квадратная труба" and length > 1.7 else 0
        }

    elif shower_type == "Трапециевидная":
        # === ОСНОВНЫЕ УСЛОВИЯ ===
        b9_value  = "П-образный профиль хром" if mount_type == "На П-профиле" else "-"
        b18_value = "Коннектор стекло-стекло 135º" if door_position == "С боку" else "-"
        b19_value = "Коннектор П-образный" if door_position == "С боку" else "-"

        # === КАРТА АРТИКУЛОВ ===
        sku_map = {
            "AAAAAA8" : f"P10089{suffix}" if door_position == "По середине" else f"P10086{suffix}",
            "AAAAAA9" : f"HS-6463{suffix}" if mount_type == "На П-профиле" else "-",
            "AAAAAA10": (
                f"Q10068{suffix}" if mount_type == "На коннекторах" and connector_type == "Коннектор Г-образный" else
                f"Q10066{suffix}" if mount_type == "На коннекторах" and connector_type == "Коннектор П-образный" else "-"
            ),
            "AAAAAA11": f"L10073{suffix}" if frame_type == "Круглая труба" else f"L10084{suffix}",
            "AAAAAA12": f"L10072{suffix}" if frame_type == "Круглая труба" else f"L10086{suffix}",
            "AAAAAA13": f"L10074{suffix}" if frame_type == "Круглая труба" else f"L10091{suffix}",
            "AAAAAA14": f"U10072{suffix}",
            "AAAAAA15": f"U10032{suffix}",
            "AAAAAA16": (
                f"J10255-19{suffix}" if handle_type == "Ручка полотенцесушитель" and frame_type == "Круглая труба" else
                f"J10265{suffix}"     if handle_type == "Ручка полотенцесушитель" and frame_type == "Квадратная труба" else
                f"J10275{suffix}"     if handle_type == "Скоба" and frame_type == "Круглая труба" else
                f"J10270{suffix}"     if handle_type == "Скоба" and frame_type == "Квадратная труба" else
                f"J10333{suffix}"     if frame_type == "Круглая труба" else
                f"J10347{suffix}"
            ),
            "AAAAAA17": (
                f"HSK-1{suffix}" if bottom_element == "Порожек" else
                f"Покуп{('-' + suffix) if suffix else ''}" if bottom_element == "Крышка на П-профиль" else "-"
            ),
            "AAAAAA18": f"Q10070{suffix}" if door_position == "С боку" else "-",
            "AAAAAA19": f"Q10066{suffix}" if door_position == "С боку" else "-"
        }

        # === КОЛИЧЕСТВА ===
        sku_qty = {
            "AAAAAA8" : 2,
            "AAAAAA9" : (
                rounded_f9 if door_position == "По середине" and mount_type == "На П-профиле" else
                rounded_f8 if door_position == "С боку" and mount_type == "На П-профиле" else 0
            ),
            "AAAAAA10": (
                8 if door_position == "По середине" and mount_type == "На коннекторах" else
                6 if door_position == "С боку" and mount_type == "На коннекторах" else 0
            ),
            "AAAAAA11": 2,
            "AAAAAA12": 2,
            "AAAAAA13": 2,
            "AAAAAA14": (
                4 if door_position == "По середине" and mount_type == "На коннекторах" else
                3 if door_position == "С боку" and mount_type == "На коннекторах" else 2
            ),
            "AAAAAA15": 1,
            "AAAAAA16": 1,
            "AAAAAA17": 1,
            "AAAAAA18": 2 if sku_map["AAAAAA18"].startswith("Q10070") else 0,
            "AAAAAA19": 2 if sku_map["AAAAAA19"].startswith("Q10066") else 0
        }

    elif shower_type == "Стационар":
        sku_map = {
            "AAAAAAA8" : f"HS-6463{suffix}" if mount_type == "На П-профиле" else "-",
            "AAAAAAA9" : (
                f"Q10068{suffix}" if mount_type == "На коннекторах" and connector_type == "Коннектор Г-образный" else
                f"Q10066{suffix}" if mount_type == "На коннекторах" and connector_type == "Коннектор П-образный" else "-"
            ),
            "AAAAAAA10": (
                f"L10073{suffix}" if frame_type == "Круглая труба" and binding_position == "Обвязка над стеклом" else
                f"L10084{suffix}" if frame_type == "Квадратная труба" and binding_position == "Обвязка над стеклом" else
                f"L10075{suffix}" if frame_type == "Круглая труба" else
                f"L10083{suffix}"
            ),
            "AAAAAAA11": f"L10072{suffix}" if frame_type == "Круглая труба" else f"L10086{suffix}",
            "AAAAAAA12": f"U10072{suffix}"
        }

        sku_qty = {
            "AAAAAAA8" : rounded_f12 if mount_type == "На П-профиле" else 0,
            "AAAAAAA9" : 4 if mount_type == "На коннекторах" else 0,
            "AAAAAAA10": 1,
            "AAAAAAA11": 2,
            "AAAAAAA12": 2
        }

    elif shower_type == "Шторка":
        # === АРТИКУЛЫ ===
        sku_map = {
            "AAAAAAAA9" : (
                f"P10088{suffix}" if curtain_type == "Распашное" else
                f"P10049{suffix}" if curtain_type == "Гормошка" else "-"
            ),
            "AAAAAAAA10": f"P10050{suffix}" if curtain_type == "Гормошка" else "-",
            "AAAAAAAA11": f"HS-6463{suffix}" if mount_type == "На П-профиле" else "-",
            "AAAAAAAA12": (
                f"Q10068{suffix}" if mount_type == "На коннекторах" and connector_type == "Коннектор Г-образный" else "-"
            ),
            "AAAAAAAA13": (
                f"Q10066{suffix}" if mount_type == "На коннекторах" and connector_type == "Коннектор П-образный" else "-"
            ),
            "AAAAAAAA14": f"U10072{suffix}",
            "AAAAAAAA15": (
                f"J10255-19{suffix}" if handle_type == "Ручка полотенцесушитель" and frame_type == "Круглая труба" else
                f"J10265{suffix}"     if handle_type == "Ручка полотенцесушитель" and frame_type == "Квадратная труба" else
                f"J10275{suffix}"     if handle_type == "Скоба" and frame_type == "Круглая труба" else
                f"J10270{suffix}"     if handle_type == "Скоба" and frame_type == "Квадратная труба" else
                f"J10333{suffix}"     if handle_type == "Кноб" and frame_type == "Круглая труба" else
                f"J10347{suffix}"     if handle_type == "Кноб" and frame_type == "Квадратная труба" else "-"
            ),
            "AAAAAAAA16": (
                f"002{suffix}"     if rigid_element_type == "Труба круглая" else
                f"S10001{suffix}"  if rigid_element_type == "Штанга круглая" else
                f"S10012{suffix}"  if rigid_element_type == "Штанга квадратная" else "-"
            ),
            "AAAAAAAA17": f"L10058{suffix}" if rigid_element_type == "Труба круглая" else "-",
            "AAAAAAAA18": f"L10078{suffix}" if rigid_element_type == "Труба круглая" else "-"
        }

        # === КОЛИЧЕСТВА ===
        sku_qty = {
            "AAAAAAAA9" : 2,
            "AAAAAAAA10": 2 if curtain_type == "Гормошка" else 0,
            "AAAAAAAA11": rounded_f11 if mount_type == "На П-профиле" else 0,
            "AAAAAAAA12": 2 if sku_map["AAAAAAAA12"] != "-" else 0,
            "AAAAAAAA13": 2 if sku_map["AAAAAAAA13"] != "-" else 0,
            "AAAAAAAA14": 2,
            "AAAAAAAA15": 1 if sku_map["AAAAAAAA15"] != "-" else 0,
            "AAAAAAAA16": (
                1 if rigid_element_type == "Штанга квадратная" and length > 0.9 else
                1 if rigid_element_type == "Штанга круглая" and length > 0.6 else
                1 if rigid_element_type in ["Штанга квадратная", "Штанга круглая", "Труба круглая"] else 0
            ),
            "AAAAAAAA17": 1 if sku_map["AAAAAAAA17"] != "-" else 0,
            "AAAAAAAA18": 1 if sku_map["AAAAAAAA18"] != "-" else 0
        }

    # === РАСЧЁТ ФУРНИТУРЫ ===
    furniture_total = 0
    furniture_items = []

    for key in sku_map:
        sku = sku_map[key]
        qty = sku_qty.get(key, 0)
        if customer_type == "юрлицо":
            info = price_catalog_legal.get(sku, {"price": 0, "name": "Не найдено"})
        else:
            info = price_catalog_physical.get(sku, {"price": 0, "name": "Не найдено"})
        price = info["price"]
        name = info["name"]
        total = price * qty
        furniture_total += total
        furniture_items.append({
            "sku": sku,
            "name": name,
            "price": price,
            "qty": qty,
            "total": total
        })

    # === РАСЧЁТ ОБВЯЗКИ ===
    binding_prices = {
        "Круглая труба": {
            "Хром": 8000,
            "Черная": 8000,
            "Бронза": 8000,
            "Золото": 8000
        },
        "Квадратная труба": {
            "Хром": 8000,
            "Черная": 8000,
            "Бронза": 8000,
            "Золото": 8000
        },
        "G-профиль": {
            "Хром": 0,
            "Черная": 0,
            "Бронза": 0,
            "Золото": 0
        }
    }

    # Цена за погонный метр
    binding_price_per_meter = binding_prices.get(frame_type, {}).get(hardware_color, 0)

    # Кол-во погонных метров с округлением вверх
    binding_meter_qty = int(length) + (1 if length % 1 > 0 else 0)

    # Итоговая стоимость
    binding_total = binding_meter_qty * binding_price_per_meter


    # === ДОСТАВКА ===
    area = length * height

    pickup_without_pack = glass_total + furniture_total + binding_total
    pickup_with_pack = pickup_without_pack + (area * 2000) # упаковка + сбор

    if city == "Алматы":
        delivery_city = pickup_with_pack
    elif city in ["Актау", "Актобе", "Астана", "Атырау", "Караганда", "Павлодар", "Семей", "Тараз", "Уральск"]:
        delivery_city = pickup_with_pack + (8000 if area < 2 else area * 3000)
    elif city == "Костанай":
        delivery_city = pickup_with_pack + (10000 if area < 2 else area * 4000)
    elif city == "Кызылорда":
        delivery_city = pickup_with_pack + (8000 if area < 2 else area * 2500)
    elif city == "Петропавловск":
        delivery_city = pickup_with_pack + (8000 if area < 2 else area * 2500)
    elif city == "Талдыкорган":
        delivery_city = pickup_with_pack + 15000
    elif city == "Усть-Каменогорск":
        delivery_city = pickup_with_pack + (10000 if area < 2 else area * 4000)
    else:
        delivery_city = pickup_with_pack
        

    # === ПАКЕТЫ С УЧЁТОМ СКИДКИ НА ОБЩУЮ СУММУ ===
    base_total = glass_total + furniture_total + binding_total
    delivery_cost = 8000  # фиксированная доставка


    # === ПАКЕТЫ ДЛЯ ОСНОВНЫХ ТИПОВ КОНСТРУКЦИЙ ===
    def calculate_packages_default(pickup_without_pack: int, tsvet: str = "Хром") -> dict:
        pickup_econom = pickup_without_pack - glass_total + glass_total_economy
        return {
            "Эконом": {
                "стоимость_пакета_без_скидки": pickup_econom + 70000,
                "итого_с_монтажом_и_скидкой": int((pickup_econom + 70000) * 0.85),
                "выгода_по_скидке": int((pickup_econom + 70000) * 0.15)
            },
            "Стандарт": {
                "стоимость_пакета_без_скидки": pickup_without_pack + 175000,
                "итого_со_скидкой": int((pickup_without_pack + 175000) * 0.75),
                "выгода_по_скидке": int((pickup_without_pack + 175000) * 0.25)
            },
            "Премиум": {
                "стоимость_пакета_без_скидки": pickup_without_pack + 265000,
                "итого_со_скидкой": int((pickup_without_pack + 265000) * 0.75),
                "выгода_по_скидке": int((pickup_without_pack + 265000) * 0.25)
            }
        }

    # === ПАКЕТЫ ДЛЯ СТАЦИОНАР / ШТОРКА / ПРЯМАЯ РАСПАШНАЯ ===
    def calculate_packages_v2(pickup_without_pack: int, tsvet: str, shower_type: str) -> dict:
        pickup_econom = pickup_without_pack - glass_total + glass_total_economy
        if shower_type in ["Стационар", "Шторка"]:
            return {
                "Эконом": {
                    "стоимость_пакета_без_скидки": pickup_econom + 60000,
                    "итого_с_монтажом_и_скидкой": int((pickup_econom + 60000) * 0.85),
                    "выгода_по_скидке": int((pickup_econom + 60000) * 0.15)
                },
                "Стандарт": {
                    "стоимость_пакета_без_скидки": pickup_without_pack + 110000,
                    "итого_со_скидкой": int((pickup_without_pack + 110000) * 0.75),
                    "выгода_по_скидке": int((pickup_without_pack + 110000) * 0.25)
                },
                "Премиум": {
                    "стоимость_пакета_без_скидки": pickup_without_pack + 160000,
                    "итого_со_скидкой": int((pickup_without_pack + 160000) * 0.75),
                    "выгода_по_скидке": int((pickup_without_pack + 160000) * 0.25)
                }
            }
        else:
            return calculate_packages_default(pickup_without_pack, tsvet)

    pickup_without_pack = glass_total + furniture_total + binding_total

    # пакеты со скидками
    packages = calculate_packages_v2(pickup_without_pack, hardware_color, shower_type)

    # === ПРОВЕРКА НА ОБЯЗАТЕЛЬНЫЕ ПАРАМЕТРЫ ===
    missing_inputs = []

    if not glass_total:
        missing_inputs.append("glass_total")
    if not furniture_total:
        missing_inputs.append("furniture_total")

    if missing_inputs:
        result = {
            "error": "Недостаточно данных для расчёта. Отсутствуют или равны нулю:",
            "missing": missing_inputs
        }
    else:
        result = {
            "glass_total":      glass_total,
            "furniture_total":  furniture_total,
            "sku_details": [  # добавляем всё по каждой позиции
                {
                    "sku": item["sku"],
                    "qty": item["qty"],
                    "price_per_unit": item["price"],
                    "total_price": item["total"]
                }
                for item in furniture_items if item["sku"] != "-"
            ],
            "binding_total":    binding_total,
            "pickup_without_pack": pickup_without_pack,
            "delivery_city":      delivery_city,
        }

        # добавляем пакеты только если физлицо
        if customer_type == "физлицо":
            result["packages"] = packages

    debug(f"Result сформирован: {result}")
    return result